---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.BentFabricSheetTooLongBendingProfile
source: html/9aed99ab-30a1-46e2-cf9a-93b5d3423feb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.BentFabricSheetTooLongBendingProfile Property

The bent edge is shorter than the bend profile for this fabric sheet type.

## Syntax (C#)
```csharp
public static FailureDefinitionId BentFabricSheetTooLongBendingProfile { get; }
```